# AnalysisDisplayColorEntry Constructor (Color) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorEntry Constructor (Color)
AnalysisDisplayColorEntry Class See Also
---
Constructs a color entry with no value assigned.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayColorEntry(
	Color color
)
```

Visual Basic
---
```text
Public Sub New ( _
	color As Color _
)
```

Visual C++
---
```text
public:
AnalysisDisplayColorEntry(
	Color^ color
)
```

# ### Parameters
color
    Type: Autodesk.Revit.DB..::..Color Color assigned to the entry.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalysisDisplayColorEntry Class
AnalysisDisplayColorEntry Overload
Autodesk.Revit.DB.Analysis Namespace